Revit 2017 API
FabricationService Methods
The FabricationService type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetButton
 Gets the service button for a given group index and button index from the service.
GetButtonCount
 Gets the number of buttons for a given group in the service.
GetGroupName
 Gets the name of a group based on group index.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidButtonIndex
 Validates the button index.
IsValidGroupIndex
 Validates the group index.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricationService Class
Autodesk.Revit.DB Namespace